In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
sr=Series
df = DataFrame

In [5]:
dframe = df(np.arange(12).reshape(3,4),
           index=['a','b','c'],
           columns=['W','X','Y','Z'])
dframe

   W  X   Y   Z
a  0  1   2   3
b  4  5   6   7
c  8  9  10  11

In [7]:
dframe.index.map(str.upper)

Index(['A', 'B', 'C'], dtype='object')

In [9]:
dframe.index = dframe.index.map(str.upper)

In [11]:
dframe

   W  X   Y   Z
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [13]:
dframe.rename(index=str.title,columns=str.lower)

   w  x   y   z
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [17]:
dframe.rename(index={'A':'row1','B':'row2'},
             columns={'W':'col1'})

      col1  X   Y   Z
row1     0  1   2   3
row2     4  5   6   7
C        8  9  10  11

In [19]:
dframe

   W  X   Y   Z
A  0  1   2   3
B  4  5   6   7
C  8  9  10  11

In [21]:
dframe.rename(index={'A':'row1','B':'row2'},
             columns={'W':'col1'},inplace=True)

In [23]:
dframe

      col1  X   Y   Z
row1     0  1   2   3
row2     4  5   6   7
C        8  9  10  11